Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC01/atdf/PIC32CK2051GC01144.atdf
            <register-group name="FUSES_DALCFG" name-in-module="FUSES_DALCFG" address-space="base" offset="0x0A004000"/>
            <register-group name="FUSES_USERCFG1" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A000000"/>
            <register-group name="FUSES_USERCFG2" name-in-module="FUSES_USERCFG1" address-space="base" offset="0x0A008000"/>
            <parameters>
              <param name="RDY_MSB" value="14"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="03726" name2="clk_gclk_u2122_v1" version="1d0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x44010000"/>
            <signals>
              <signal group="IO" index="0" function="M" pad="PA09" ioset="2"/>
              <signal group="IO" index="0" function="M" pad="PA03" ioset="1"/>
              <signal group="IO" index="1" function="M" pad="PA01" ioset="1"/>
              <signal group="IO" index="1" function="M" pad="PA10" ioset="2"/>
              <signal group="IO" index="2" function="M" pad="PA20" ioset="3"/>
              <signal group="IO" index="2" function="M" pad="PC00" ioset="1"/>
              <signal group="IO" index="2" function="M" pad="PD12" ioset="2"/>
              <signal group="IO" index="3" function="M" pad="PA21" ioset="3"/>
              <signal group="IO" index="3" function="M" pad="PC01" ioset="1"/>
              <signal group="IO" index="3" function="M" pad="PD05" ioset="2"/>
              <signal group="IO" index="4" function="M" pad="PA22" ioset="3"/>
              <signal group="IO" index="4" function="M" pad="PC02" ioset="1"/>
              <signal group="IO" index="4" function="M" pad="PD06" ioset="2"/>
              <signal group="IO" index="5" function="M" pad="PA23" ioset="3"/>
              <signal group="IO" index="5" function="M" pad="PC03" ioset="1"/>
              <signal group="IO" index="5" function="M" pad="PD07" ioset="2"/>
              <signal group="IO" index="6" function="M" pad="PA17" ioset="2"/>
              <signal group="IO" index="6" function="M" pad="PC04" ioset="1"/>
              <signal group="IO" index="7" function="M" pad="PA24" ioset="2"/>
              <signal group="IO" index="7" function="M" pad="PC05" ioset="1"/>
            </signals>
            <parameters>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="12" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="11" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="11" caption="Number of Generic Clock Sources - 1"/>
              <param name="IO_NUM" value="8" caption="Number of Generic Clock I/Os"/>
              <param name="NUM" value="48" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="12" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="8" caption="Instance index for GCLK"/>
              <param name="MCLK_ID_APB" value="40" caption="Index for GCLK APB clock"/>
              <param name="PAC_ID" value="8" caption="Index for GCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIX2" id="bus_hmatrix2_v5" name2="bus_hmatrix2_v5" version="5f0">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIX2" address-space="base" offset="0x44806000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35" caption="Instance index for HMATRIX"/>
              <param name="MCLK_ID_AHB" value="10" caption="Index for HMATRIX AHB clock"/>
              <param name="MCLK_ID_APB" value="67" caption="Index for HMATRIX APB clock"/>
              <param name="PAC_ID" value="35" caption="Index for HMATRIX registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ICB" id="SYSTEM_IP" version="1.0.0">
          <instance name="ICB">
            <register-group name="ICB" name-in-module="ICB" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="IDAU" id="04250" name2="sec_idau_v3" version="3a0">
          <instance name="IDAU">
            <register-group name="IDAU" name-in-module="IDAU" address-space="base" offset="0x4480C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38" caption="Instance index for IDAU"/>
              <param name="MCLK_ID_APB" value="69" caption="Index for IDAU APB clock"/>
              <param name="PAC_ID" value="38" caption="Index for IDAU registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ITM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
          </instance>
        </module>
        <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x44012000"/>
            <parameters>
              <param name="DIV_CLK_NUM" value="1"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for MCLK"/>
              <param name="MCLK_ID_APB" value="41" caption="Index for MCLK APB clock"/>
              <param name="PAC_ID" value="9" caption="Index for MCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
            <parameters>
              <param name="__MPU_REGIONS" value="8" caption="Number of MPU regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="158" caption="Number of interrupt request lines"/>
            </parameters>
          </instance>
        </module>
