Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC01/atdf/PIC32CK2051GC01144.atdf
        <register name="DEBOUNCEN" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Debouncer Enable">
          <bitfield name="DEBOUNCEN" caption="Debouncer Enable" mask="0xFFFF"/>
        </register>
        <register name="DPRESCALER" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Debouncer Prescaler">
          <bitfield name="PRESCALER0" caption="Debouncer Prescaler" mask="0x7" values="EIC_DPRESCALER__PRESCALER0"/>
          <bitfield name="STATES0" caption="Debouncer number of states" mask="0x8" values="EIC_DPRESCALER__STATES0"/>
          <bitfield name="PRESCALER1" caption="Debouncer Prescaler" mask="0x70" values="EIC_DPRESCALER__PRESCALER1"/>
          <bitfield name="STATES1" caption="Debouncer number of states" mask="0x80" values="EIC_DPRESCALER__STATES1"/>
          <bitfield name="TICKON" caption="Pin Sampler frequency selection" mask="0x10000" values="EIC_DPRESCALER__TICKON"/>
        </register>
        <register name="PINSTATE" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Pin State">
          <bitfield name="PINSTATE" caption="Pin State" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="EIC_CTRLA__CKSEL">
        <value name="CLK_GCLK" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_ULP32K" caption="Clocked by ULP32K" value="1"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising-edge detection" value="1"/>
        <value name="FALL" caption="Falling-edge detection" value="2"/>
        <value name="BOTH" caption="Both-edges detection" value="3"/>
        <value name="HIGH" caption="High-level detection" value="4"/>
        <value name="LOW" caption="Low-level detection" value="5"/>
      </value-group>
      <value-group name="EIC_NMICTRL__NMIASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_ASYNCH__ASYNCH">
        <value name="SYNC" caption="Edge detection is clock synchronously operated" value="0"/>
        <value name="ASYNC" caption="Edge detection is clock asynchronously operated" value="1"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__PRESCALER0">
        <value name="DIV2" caption="EIC clock divided by 2" value="0"/>
        <value name="DIV4" caption="EIC clock divided by 4" value="1"/>
        <value name="DIV8" caption="EIC clock divided by 8" value="2"/>
        <value name="DIV16" caption="EIC clock divided by 16" value="3"/>
        <value name="DIV32" caption="EIC clock divided by 32" value="4"/>
        <value name="DIV64" caption="EIC clock divided by 64" value="5"/>
        <value name="DIV128" caption="EIC clock divided by 128" value="6"/>
        <value name="DIV256" caption="EIC clock divided by 256" value="7"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__STATES0">
        <value name="LFREQ3" caption="3 low frequency samples" value="0"/>
        <value name="LFREQ7" caption="7 low frequency samples" value="1"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__PRESCALER1">
        <value name="DIV2" caption="EIC clock divided by 2" value="0"/>
        <value name="DIV4" caption="EIC clock divided by 4" value="1"/>
        <value name="DIV8" caption="EIC clock divided by 8" value="2"/>
        <value name="DIV16" caption="EIC clock divided by 16" value="3"/>
        <value name="DIV32" caption="EIC clock divided by 32" value="4"/>
        <value name="DIV64" caption="EIC clock divided by 64" value="5"/>
        <value name="DIV128" caption="EIC clock divided by 128" value="6"/>
        <value name="DIV256" caption="EIC clock divided by 256" value="7"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__STATES1">
        <value name="LFREQ3" caption="3 low frequency samples" value="0"/>
        <value name="LFREQ7" caption="7 low frequency samples" value="1"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__TICKON">
        <value name="CLK_GCLK_EIC" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_LFREQ" caption="Clocked by Low Frequency Clock" value="1"/>
      </value-group>
      <value-group name="CONFIG__SENSE1">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="CONFIG__SENSE2">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="CONFIG__SENSE3">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="CONFIG__SENSE4">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
