Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC01/atdf/PIC32CK2051GC01144.atdf
        <register name="TLPITI" offset="0x127C" rw="R" size="4" initval="0x00000000" caption="Receive LPI Time Register">
          <bitfield name="TLPITI" caption="Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="EVSYS" id="03601" name2="ptg_evsys_u2504_v2" version="2b0" caption="Event System Interface">
      <register-group name="CHANNEL" size="0x8">
        <register name="CHANNEL" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="Channel n Control">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="CHINTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Disable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Disable" mask="0x2"/>
        </register>
        <register name="CHINTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Enable" mask="0x2"/>
        </register>
        <register name="CHINTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="OVR" caption="Channel Overrun" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x2"/>
        </register>
        <register name="CHSTATUS" offset="0x7" rw="R" size="1" initval="0x01" caption="Channel n Status">
          <bitfield name="RDYUSR" caption="Ready User" mask="0x1"/>
          <bitfield name="BUSYCH" caption="Busy Channel" mask="0x2"/>
        </register>
      </register-group>
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRLA" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SWEVT" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80"/>
          <bitfield name="CHANNEL8" caption="Channel 8 Software Selection" mask="0x100"/>
          <bitfield name="CHANNEL9" caption="Channel 9 Software Selection" mask="0x200"/>
          <bitfield name="CHANNEL10" caption="Channel 10 Software Selection" mask="0x400"/>
          <bitfield name="CHANNEL11" caption="Channel 11 Software Selection" mask="0x800"/>
          <bitfield name="CHANNEL12" caption="Channel 12 Software Selection" mask="0x1000"/>
          <bitfield name="CHANNEL13" caption="Channel 13 Software Selection" mask="0x2000"/>
          <bitfield name="CHANNEL14" caption="Channel 14 Software Selection" mask="0x4000"/>
          <bitfield name="CHANNEL15" caption="Channel 15 Software Selection" mask="0x8000"/>
          <bitfield name="CHANNEL16" caption="Channel 16 Software Selection" mask="0x10000"/>
          <bitfield name="CHANNEL17" caption="Channel 17 Software Selection" mask="0x20000"/>
          <bitfield name="CHANNEL18" caption="Channel 18 Software Selection" mask="0x40000"/>
          <bitfield name="CHANNEL19" caption="Channel 19 Software Selection" mask="0x80000"/>
          <bitfield name="CHANNEL20" caption="Channel 20 Software Selection" mask="0x100000"/>
          <bitfield name="CHANNEL21" caption="Channel 21 Software Selection" mask="0x200000"/>
          <bitfield name="CHANNEL22" caption="Channel 22 Software Selection" mask="0x400000"/>
          <bitfield name="CHANNEL23" caption="Channel 23 Software Selection" mask="0x800000"/>
          <bitfield name="CHANNEL24" caption="Channel 24 Software Selection" mask="0x1000000"/>
          <bitfield name="CHANNEL25" caption="Channel 25 Software Selection" mask="0x2000000"/>
          <bitfield name="CHANNEL26" caption="Channel 26 Software Selection" mask="0x4000000"/>
          <bitfield name="CHANNEL27" caption="Channel 27 Software Selection" mask="0x8000000"/>
          <bitfield name="CHANNEL28" caption="Channel 28 Software Selection" mask="0x10000000"/>
          <bitfield name="CHANNEL29" caption="Channel 29 Software Selection" mask="0x20000000"/>
          <bitfield name="CHANNEL30" caption="Channel 30 Software Selection" mask="0x40000000"/>
          <bitfield name="CHANNEL31" caption="Channel 31 Software Selection" mask="0x80000000"/>
        </register>
        <register name="PRICTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="Priority Control">
          <bitfield name="PRI" caption="Channel Priority Number" mask="0xF"/>
          <bitfield name="RREN" caption="Round-Robin Scheduling Enable" mask="0x80"/>
        </register>
        <register name="INTPEND" offset="0x10" rw="RW" size="2" initval="0x4000" caption="Channel Pending Interrupt">
          <bitfield name="ID" caption="Channel ID" mask="0xF"/>
          <bitfield name="OVR" caption="Channel Overrun" mask="0x100"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x200"/>
          <bitfield name="READY" caption="Ready" mask="0x4000"/>
          <bitfield name="BUSY" caption="Busy" mask="0x8000"/>
        </register>
        <register name="INTSTATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Interrupt Status">
          <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1"/>
          <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2"/>
          <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4"/>
          <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8"/>
          <bitfield name="CHINT4" caption="Channel 4 Pending Interrupt" mask="0x10"/>
          <bitfield name="CHINT5" caption="Channel 5 Pending Interrupt" mask="0x20"/>
          <bitfield name="CHINT6" caption="Channel 6 Pending Interrupt" mask="0x40"/>
          <bitfield name="CHINT7" caption="Channel 7 Pending Interrupt" mask="0x80"/>
          <bitfield name="CHINT8" caption="Channel 8 Pending Interrupt" mask="0x100"/>
          <bitfield name="CHINT9" caption="Channel 9 Pending Interrupt" mask="0x200"/>
          <bitfield name="CHINT10" caption="Channel 10 Pending Interrupt" mask="0x400"/>
          <bitfield name="CHINT11" caption="Channel 11 Pending Interrupt" mask="0x800"/>
        </register>
