Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC01/atdf/PIC32CK2051GC01144.atdf
        <register name="CRCMLEN" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="CRC Message Length Register">
          <bitfield name="CRCMLEN" caption="Message Length in Bytes" mask="0xFFFFFF"/>
        </register>
        <register name="CRCIV" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="CRC Initial Value Register">
          <bitfield name="CRCIV" caption="CRC Initial Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCACC" offset="0x34" rw="R" size="4" initval="0x00000000" caption="CRC Accumulator Register">
          <bitfield name="CRCACC" caption="CRC Accumulator Result" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCPOLY" offset="0x38" rw="RW" size="4" initval="0x00000001" caption="CRC Polynomial Register">
          <bitfield name="CRCPOLY" caption="CRC Polynomial Coefficients for LFSR" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCFXOR" offset="0x3C" rw="RW" size="4" initval="0x00000000" caption="CRC Final XOR Register">
          <bitfield name="CRCFXOR" caption="CRC Final XOR" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCSUM" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum Register">
          <bitfield name="CRCSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="FFLTCTRL" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Control Register">
          <bitfield name="FLTRST" caption="Fault Reset" mask="0x1"/>
          <bitfield name="FLTEN" caption="ECC Fault Enable bit" mask="0x2"/>
          <bitfield name="CTLFLT" caption="ECC/Parity Control Fault bits" mask="0x700"/>
          <bitfield name="FLTMD" caption="Fault Mode Control" mask="0x7000"/>
        </register>
        <register name="FFLTPTR" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="Flash ECC Fault Pointer Register">
          <bitfield name="FLT1PTR" caption="Fault 1 Injection Pointer" mask="0x1FF"/>
          <bitfield name="FLT2PTR" caption="Fault 2 Injection Pointer" mask="0x1FF0000"/>
        </register>
        <register name="FFLTADR" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="Flash Fault Address Register">
          <bitfield name="FLTADR" caption="Fault Inject Mode - Physical Address" mask="0xFFFFFFF"/>
        </register>
        <register name="FFLTCAP" offset="0x50" rw="R" size="4" initval="0x00000000" caption="Flash Fault Capture Address Register">
          <bitfield name="FLTADR" caption="Fault capture Mode - Physical Address" mask="0xFFFFFFF"/>
        </register>
        <register name="FFLTPAR" offset="0x54" rw="R" size="4" initval="0x00000000" caption="Flash ECC Fault Parity Register">
          <bitfield name="SECIN" caption="The Single Error Parity bits from Flash" mask="0x1FF"/>
          <bitfield name="DEDIN" caption="The Overall Parity from Flash" mask="0x8000"/>
          <bitfield name="SECOUT" caption="The Calculated Single Error Parity bits" mask="0x1FF0000"/>
          <bitfield name="DEDOUT" caption="The Calculated Overall Parity used in Double Error Detection" mask="0x80000000"/>
        </register>
        <register name="FFLTSYN" offset="0x58" rw="R" size="4" initval="0x00000000" caption="Flash ECC Fault Syndrome Register">
          <bitfield name="SECSYN" caption="Single Error Correction Syndrome" mask="0x1FF"/>
          <bitfield name="DEDSYN" caption="DED Syndrome" mask="0x8000"/>
          <bitfield name="DERR" caption="Double Error Detected &amp; Single Error Corrected" mask="0x30000"/>
          <bitfield name="CERR" caption="ECC Control bit Error" mask="0x40000"/>
          <bitfield name="CTLSTAT" caption="Parity vs ECC Control Status" mask="0x7000000"/>
          <bitfield name="PERR" caption="Per Word Parity Error Status" mask="0xF8000000"/>
        </register>
        <register name="CRP" offset="0x5C" rw="RW" size="4" initval="0x00000000" caption="CFM Page Read Protect Register">
          <bitfield name="BC1RP" caption="Boot Configuration Page 1 Read Protect Bit" mask="0x4"/>
          <bitfield name="BC2RP" caption="Boot Configuration Page 2 Read Protect Bit" mask="0x400"/>
          <bitfield name="BC1RPLOCK" caption="Boot Configuration Page 1 RP Lock Bit" mask="0x40000"/>
          <bitfield name="BC2RPLOCK" caption="Boot Configuration Page 2 RP Lock Bit" mask="0x4000000"/>
        </register>
        <register name="HSMCTRL" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="HSM CFM PAGES Control Register">
          <bitfield name="ECCDIS" caption="ECC Disable for HSM Pages in CFM" mask="0x1"/>
          <bitfield name="KEYZ" caption="Flash Key Locations read 0\xd5 s" mask="0x2"/>
        </register>
      </register-group>
    </module>
    <module name="FCW" id="03433" name2="pfm_ctrlw_apb_v1" version="1b0" caption="Flash Write Control (FCW)">
      <register-group name="FCW" caption="Flash Write Control (FCW)">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="NVM Write Control Register">
          <bitfield name="NVMOP" caption="NVM Operation" mask="0xF"/>
          <bitfield name="PREPG" caption="NVM Pre-Program Configuration Bit" mask="0x80"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x000000FF" caption="NVM Control B Register">
          <bitfield name="SDALCPU0" caption="Set DAL for CPU n" mask="0x3"/>
          <bitfield name="SDALCPU1" caption="Set DAL for CPU n" mask="0xC"/>
          <bitfield name="SDALCPU2" caption="Set DAL for CPU n" mask="0x30"/>
          <bitfield name="SDALCPU3" caption="Set DAL for CPU n" mask="0xC0"/>
        </register>
        <register name="MUTEX" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="NVM MUTEX Register">
          <bitfield name="LOCK" caption="Flash Write Controller (FCW) Lock by Owner" mask="0x1"/>
          <bitfield name="OWNER" caption="Flash Write Controller (FCW) Owner ID" mask="0x6"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="NVM Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="NVM Operation Done Interrupt Enable Bit" mask="0x1"/>
          <bitfield name="KEYERR" caption="Key Error Interrupt Enable Bit" mask="0x2"/>
          <bitfield name="CFGERR" caption="Configuration Error Interrupt Enable Bit" mask="0x4"/>
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Interrupt Enable Bit" mask="0x8"/>
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Interrupt Enable Bit" mask="0x10"/>
          <bitfield name="WPERR" caption="Write Protection Error Interrupt Enable Bit" mask="0x20"/>
          <bitfield name="OPERR" caption="NVMOP Error Interrupt Enable Bit" mask="0x40"/>
          <bitfield name="SECERR" caption="Security Violation Error Interrupt Enable Bit" mask="0x80"/>
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Interrupt Enable Bit" mask="0x100"/>
          <bitfield name="BORERR" caption="Brown Out Detect Error Interrupt Enable Bit" mask="0x1000"/>
          <bitfield name="WRERR" caption="Write Error Interrupt Enable Bit" mask="0x2000"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="NVM Interrupt Enable SET Register">
          <bitfield name="DONE" caption="NVM Operation Done Interrupt Enable Bit" mask="0x1"/>
          <bitfield name="KEYERR" caption="Key Error Interrupt Enable Bit" mask="0x2"/>
          <bitfield name="CFGERR" caption="Configuration Error Interrupt Enable Bit" mask="0x4"/>
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Interrupt Enable Bit" mask="0x8"/>
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Interrupt Enable Bit" mask="0x10"/>
          <bitfield name="WPERR" caption="Write Protection Error Interrupt Enable Bit" mask="0x20"/>
          <bitfield name="OPERR" caption="NVMOP Error Interrupt Enable Bit" mask="0x40"/>
          <bitfield name="SECERR" caption="Security Violation Error Interrupt Enable Bit" mask="0x80"/>
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Interrupt Enable Bit" mask="0x100"/>
          <bitfield name="BORERR" caption="Brown Out Detect Error Interrupt Enable Bit" mask="0x1000"/>
          <bitfield name="WRERR" caption="Write Error Interrupt Enable Bit" mask="0x2000"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="NVM Interrupt Flag Register">
          <bitfield name="DONE" caption="NVM Operation Done Flag Bit" mask="0x1"/>
          <bitfield name="KEYERR" caption="Key Error Flag Bit" mask="0x2"/>
          <bitfield name="CFGERR" caption="Configuration Error Flag Bit" mask="0x4"/>
          <bitfield name="FIFOERR" caption="FIFO Underrun during Row Write Flag Bit" mask="0x8"/>
          <bitfield name="BUSERR" caption="AHB Bus Error during Row Write Flag Bit" mask="0x10"/>
          <bitfield name="WPERR" caption="Write Protection Error Flag Bit" mask="0x20"/>
          <bitfield name="OPERR" caption="NVMOP Error Flag Bit" mask="0x40"/>
          <bitfield name="SECERR" caption="Security Violation Error Bit" mask="0x80"/>
          <bitfield name="HTDPGM" caption="High Temperature Detect Error Flag Bit" mask="0x100"/>
          <bitfield name="BORERR" caption="Brown Out Detect Error Flag Bit" mask="0x1000"/>
          <bitfield name="WRERR" caption="Write Error Flag Bit" mask="0x2000"/>
        </register>
