Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC01/atdf/PIC32CK2051GC01144.atdf
      <value-group name="PHY00__RXPHSSEL">
        <value name="EARLIEST" caption="Earliest phase" value="0x0"/>
        <value name="LATEST" caption="Latest phase" value="0x7"/>
      </value-group>
    </module>
    <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby" mask="0x40"/>
          <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
        </register>
        <register name="CONFIG" offset="0x1" rw="RW" size="1" initval="0xBB" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="CONFIG__PER"/>
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="CONFIG__WINDOW"/>
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" initval="0x0B" caption="Early Warning Interrupt Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="EWCTRL__EWOFFSET"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby Synchronization Busy" mask="0x8"/>
          <bitfield name="ALWAYSON" caption="Always-On Synchronization Busy" mask="0x10"/>
          <bitfield name="CLEAR" caption="Clear Synchronization Busy" mask="0x20"/>
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="CLEAR__CLEAR"/>
        </register>
      </register-group>
      <value-group name="CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="P144" caption="P144">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="RESET_N"/>
      <pin position="6" pad="GND"/>
      <pin position="7" pad="VDDIO"/>
      <pin position="8" pad="PA20"/>
      <pin position="9" pad="PA21"/>
      <pin position="10" pad="PA22"/>
      <pin position="11" pad="PA23"/>
      <pin position="12" pad="PA13"/>
      <pin position="13" pad="PA14"/>
      <pin position="14" pad="PA15"/>
      <pin position="15" pad="PA16"/>
      <pin position="16" pad="PA17"/>
      <pin position="17" pad="PA24"/>
      <pin position="18" pad="GND"/>
      <pin position="19" pad="VDDIO"/>
      <pin position="20" pad="PA25"/>
      <pin position="21" pad="PA26"/>
      <pin position="22" pad="PA27"/>
      <pin position="23" pad="PA04"/>
      <pin position="24" pad="PA05"/>
      <pin position="25" pad="PA06"/>
      <pin position="26" pad="PA07"/>
      <pin position="27" pad="PA08"/>
      <pin position="28" pad="PA18"/>
      <pin position="29" pad="PA28"/>
      <pin position="30" pad="GND"/>
      <pin position="31" pad="VDDIO"/>
      <pin position="32" pad="EXT"/>
      <pin position="33" pad="PA09"/>
      <pin position="34" pad="ATEST"/>
      <pin position="35" pad="PA11"/>
      <pin position="36" pad="PA12"/>
      <pin position="37" pad="PB00"/>
      <pin position="38" pad="VREFH"/>
      <pin position="39" pad="PB11"/>
      <pin position="40" pad="PB12"/>
      <pin position="41" pad="PB18"/>
      <pin position="42" pad="PB19"/>
      <pin position="43" pad="PB20"/>
      <pin position="44" pad="VSSA"/>
      <pin position="45" pad="PB02"/>
      <pin position="46" pad="PB03"/>
      <pin position="47" pad="VDDA"/>
      <pin position="48" pad="VDDIO"/>
      <pin position="49" pad="GND"/>
      <pin position="50" pad="PB04"/>
      <pin position="51" pad="PB05"/>
      <pin position="52" pad="PB13"/>
      <pin position="53" pad="PB06"/>
      <pin position="54" pad="PB14"/>
      <pin position="55" pad="PB15"/>
      <pin position="56" pad="VDDIO"/>
      <pin position="57" pad="GND"/>
      <pin position="58" pad="VDDREG"/>
      <pin position="59" pad="PB21"/>
      <pin position="60" pad="PB22"/>
      <pin position="61" pad="PB23"/>
      <pin position="62" pad="PB24"/>
      <pin position="63" pad="PB25"/>
      <pin position="64" pad="PB26"/>
      <pin position="65" pad="PB16"/>
      <pin position="66" pad="VDDIO"/>
      <pin position="67" pad="GND"/>
      <pin position="68" pad="PB17"/>
      <pin position="69" pad="PB07"/>
      <pin position="70" pad="PB08"/>
      <pin position="71" pad="PB09"/>
      <pin position="72" pad="PB10"/>
      <pin position="73" pad="PC00"/>
      <pin position="74" pad="PC01"/>
      <pin position="75" pad="PC02"/>
      <pin position="76" pad="PC03"/>
      <pin position="77" pad="PC04"/>
      <pin position="78" pad="VDDIO"/>
      <pin position="79" pad="GND"/>
      <pin position="80" pad="PC21"/>
      <pin position="81" pad="PC22"/>
      <pin position="82" pad="PC14"/>
      <pin position="83" pad="PC23"/>
      <pin position="84" pad="PC05"/>
      <pin position="85" pad="PC06"/>
      <pin position="86" pad="PC07"/>
      <pin position="87" pad="PC24"/>
      <pin position="88" pad="PC25"/>
      <pin position="89" pad="VDDREG"/>
      <pin position="90" pad="VDDIO"/>
      <pin position="91" pad="GND"/>
      <pin position="92" pad="PC26"/>
      <pin position="93" pad="PC27"/>
      <pin position="94" pad="PC09"/>
      <pin position="95" pad="PC15"/>
      <pin position="96" pad="PC28"/>
      <pin position="97" pad="PC29"/>
      <pin position="98" pad="PC16"/>
      <pin position="99" pad="PC17"/>
      <pin position="100" pad="PC18"/>
      <pin position="101" pad="PC10"/>
      <pin position="102" pad="VDDIO"/>
      <pin position="103" pad="GND"/>
      <pin position="104" pad="PC11"/>
      <pin position="105" pad="PC12"/>
      <pin position="106" pad="PC13"/>
      <pin position="107" pad="PC19"/>
      <pin position="108" pad="PC20"/>
      <pin position="109" pad="USB0PN"/>
      <pin position="110" pad="USB0PP"/>
      <pin position="111" pad="USB0ID"/>
      <pin position="112" pad="VCCAP3"/>
      <pin position="113" pad="USBVSSA"/>
      <pin position="114" pad="VBUS"/>
      <pin position="115" pad="USRBIAS"/>
      <pin position="116" pad="VDDREG"/>
      <pin position="117" pad="VSSIO"/>
      <pin position="118" pad="VDDIO"/>
      <pin position="119" pad="PD00"/>
      <pin position="120" pad="PD01"/>
      <pin position="121" pad="PD02"/>
      <pin position="122" pad="PD03"/>
      <pin position="123" pad="PD04"/>
      <pin position="124" pad="PD13"/>
      <pin position="125" pad="PD14"/>
      <pin position="126" pad="PD15"/>
      <pin position="127" pad="PD16"/>
      <pin position="128" pad="GND"/>
      <pin position="129" pad="VDDIO"/>
      <pin position="130" pad="PD17"/>
      <pin position="131" pad="PD18"/>
      <pin position="132" pad="PD19"/>
      <pin position="133" pad="PD20"/>
      <pin position="134" pad="PD21"/>
      <pin position="135" pad="PD12"/>
      <pin position="136" pad="PD05"/>
      <pin position="137" pad="PD06"/>
      <pin position="138" pad="PD07"/>
      <pin position="139" pad="GND"/>
      <pin position="140" pad="VDDIOB"/>
      <pin position="141" pad="PD08"/>
      <pin position="142" pad="PD09"/>
      <pin position="143" pad="PD10"/>
      <pin position="144" pad="PD11"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
